// 예제 1-1 
//
//#include <stdio.h>  // 헤더 파일 stdio.h 호출
//					/* #include : #으로 시작하는 컴파일러 전처리 구문 중 하나로, include의 경우 헤더 파일 호출에 쓰인다.
//					 * 헤더 파일 : 함수를 호출하기 위해, 함수의 원형을 컴파일러가 알 수 있도록 선언해놓은 소스 코드. 
//									다른 소스 코드의 최상단에서 #include 뒤 괄호<> 내에 기입하는 방식으로 호출하여 사용하며, 
//									C언어의 표준함수가 선언된 '표준 헤더'와, 사용자가 직접 만들어 사용하는 '사용자 헤더'가 있다.
//					 * stdio.h : Standard Input Output Library의 약어. 'scanf, printf'를 비롯한 표준 입력 출력 함수가 선언되어 있는 표준 라이브러리 이다.*/
//void main() {		// * 메인(main) 함수 : C언어로 된 모든 프로그램의 시작 위치가 되는 함수이며, 모든 .c로 된 소스 코드에 반드시 한 번은 선언되어야 한다.
//					// * void : main 함수의 반환값의 자료형이 없음(void)을 의미한다. (= 반환값이 없음)
//					// 함수는 반환값의 자료형과 함수명칭, 입력값의 자료형을 선언한 후, 내용을 중괄호{} 안에 기입하여 정의한다.
//		printf("Hello~ \n"); // C언어의 실행 화면에서 "Hello~ "를 출력 후 줄 바꿈을 실행하는 구문
//							 // printf 함수 : C언어의 실행 화면에 다양한 자료형의 변수를 문자열 출력해주는 함수이다.
//							 // \n : printf 내 입력된 문자열을 실행 화면 내 출력 후 줄 바꿈
//}					// 메인 함수 종결 부분
//
